; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=5, packages=13, locations=14, density=0.5274725274725275, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=28, seed=69

(define (problem transport-28)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l6)
    (at p2 l14)
    (at p3 l13)
    (at p4 l13)
    (at p5 l14)
    (at p6 l9)
    (at p7 l7)
    (at p8 l8)
    (at p9 l14)
    (at p10 l7)
    (at p11 l10)
    (at p12 l8)
    (at p13 l14)
    (at v1 l9)
    (at v2 l6)
    (at v3 l9)
    (at v4 l9)
    (at v5 l13)
    (road l4 l7)
    (road l9 l1)
    (road l5 l6)
    (road l14 l4)
    (road l13 l4)
    (road l4 l12)
    (road l6 l14)
    (road l8 l14)
    (road l13 l3)
    (road l1 l14)
    (road l4 l13)
    (road l14 l1)
    (road l9 l11)
    (road l10 l9)
    (road l3 l13)
    (road l11 l9)
    (road l4 l14)
    (road l14 l6)
    (road l9 l10)
    (road l1 l9)
    (road l14 l2)
    (road l2 l14)
    (road l6 l5)
    (road l7 l4)
    (road l12 l4)
    (road l14 l8)
    (road l4 l10)
    (road l10 l4)
    (road l1 l7)
    (road l7 l1)
    (road l2 l13)
    (road l13 l2)
    (road l1 l11)
    (road l11 l1)
    (road l3 l9)
    (road l9 l3)
    (road l8 l9)
    (road l9 l8)
    (road l3 l5)
    (road l5 l3)
    (road l8 l12)
    (road l12 l8)
    (road l6 l9)
    (road l9 l6)
    (road l3 l10)
    (road l10 l3)
    (road l13 l14)
    (road l14 l13)
    (road l3 l11)
    (road l11 l3)
    (road l2 l12)
    (road l12 l2)
    (road l5 l7)
    (road l7 l5)
    (road l7 l11)
    (road l11 l7)
    (road l11 l12)
    (road l12 l11)
    (road l5 l12)
    (road l12 l5)
    (road l8 l11)
    (road l11 l8)
    (road l1 l2)
    (road l2 l1)
    (road l1 l8)
    (road l8 l1)
    (road l2 l7)
    (road l7 l2)
    (road l5 l13)
    (road l13 l5)
    (road l4 l11)
    (road l11 l4)
    (road l1 l5)
    (road l5 l1)
    (road l11 l14)
    (road l14 l11)
    (road l6 l11)
    (road l11 l6)
    (road l10 l12)
    (road l12 l10)
    (road l2 l6)
    (road l6 l2)
    (road l9 l14)
    (road l14 l9)
    (road l1 l4)
    (road l4 l1)
    (road l1 l3)
    (road l3 l1)
    (road l3 l6)
    (road l6 l3)
    (road l8 l13)
    (road l13 l8)
    (road l3 l4)
    (road l4 l3)
    (road l5 l14)
    (road l14 l5)
    )
 (:goal  (and 
    (at p1 l2)
    (at p2 l2)
    (at p3 l7)
    (at p4 l3)
    (at p5 l13)
    (at p6 l2)
    (at p7 l13)
    (at p8 l11)
    (at p9 l2)
    (at p10 l14)
    (at p11 l12)
    (at p12 l12)
    (at p13 l13))))

; plan
1. (pick-up v5 l13 p3 c1 c2)
   deleted: (at p3 l13) (capacity v5 c2)
   added: (in p3 v5) (capacity v5 c1)
   goals met: 0 of 13
2. (pick-up v2 l6 p1 c0 c1)
   deleted: (at p1 l6) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 0 of 13
3. (drive v2 l6 l2)
   deleted: (at v2 l6)
   added: (at v2 l2)
   goals met: 0 of 13
4. (drop v2 l2 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l2) (capacity v2 c1)
   goals met: 1 of 13
5. (pick-up v5 l13 p4 c0 c1)
   deleted: (at p4 l13) (capacity v5 c1)
   added: (in p4 v5) (capacity v5 c0)
   goals met: 1 of 13
6. (drive v5 l13 l3)
   deleted: (at v5 l13)
   added: (at v5 l3)
   goals met: 1 of 13
7. (drop v5 l3 p4 c0 c1)
   deleted: (in p4 v5) (capacity v5 c0)
   added: (at p4 l3) (capacity v5 c1)
   goals met: 2 of 13
8. (drive v5 l3 l5)
   deleted: (at v5 l3)
   added: (at v5 l5)
   goals met: 2 of 13
9. (drive v5 l5 l7)
   deleted: (at v5 l5)
   added: (at v5 l7)
   goals met: 2 of 13
10. (drop v5 l7 p3 c1 c2)
   deleted: (in p3 v5) (capacity v5 c1)
   added: (at p3 l7) (capacity v5 c2)
   goals met: 3 of 13
11. (pick-up v1 l9 p6 c0 c1)
   deleted: (at p6 l9) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 3 of 13
12. (drive v1 l9 l6)
   deleted: (at v1 l9)
   added: (at v1 l6)
   goals met: 3 of 13
13. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 3 of 13
14. (drop v1 l2 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l2) (capacity v1 c1)
   goals met: 4 of 13
15. (drive v3 l9 l10)
   deleted: (at v3 l9)
   added: (at v3 l10)
   goals met: 4 of 13
16. (drive v4 l9 l11)
   deleted: (at v4 l9)
   added: (at v4 l11)
   goals met: 4 of 13
17. (pick-up v3 l10 p11 c0 c1)
   deleted: (at p11 l10) (capacity v3 c1)
   added: (in p11 v3) (capacity v3 c0)
   goals met: 4 of 13
18. (drive v3 l10 l12)
   deleted: (at v3 l10)
   added: (at v3 l12)
   goals met: 4 of 13
19. (drop v3 l12 p11 c0 c1)
   deleted: (in p11 v3) (capacity v3 c0)
   added: (at p11 l12) (capacity v3 c1)
   goals met: 5 of 13
20. (drive v4 l11 l8)
   deleted: (at v4 l11)
   added: (at v4 l8)
   goals met: 5 of 13
21. (pick-up v4 l8 p8 c0 c1)
   deleted: (at p8 l8) (capacity v4 c1)
   added: (in p8 v4) (capacity v4 c0)
   goals met: 5 of 13
22. (drive v4 l8 l11)
   deleted: (at v4 l8)
   added: (at v4 l11)
   goals met: 5 of 13
23. (drop v4 l11 p8 c0 c1)
   deleted: (in p8 v4) (capacity v4 c0)
   added: (at p8 l11) (capacity v4 c1)
   goals met: 6 of 13
24. (drive v3 l12 l8)
   deleted: (at v3 l12)
   added: (at v3 l8)
   goals met: 6 of 13
25. (pick-up v3 l8 p12 c0 c1)
   deleted: (at p12 l8) (capacity v3 c1)
   added: (in p12 v3) (capacity v3 c0)
   goals met: 6 of 13
26. (drive v3 l8 l12)
   deleted: (at v3 l8)
   added: (at v3 l12)
   goals met: 6 of 13
27. (drop v3 l12 p12 c0 c1)
   deleted: (in p12 v3) (capacity v3 c0)
   added: (at p12 l12) (capacity v3 c1)
   goals met: 7 of 13
28. (drive v1 l2 l14)
   deleted: (at v1 l2)
   added: (at v1 l14)
   goals met: 7 of 13
29. (pick-up v1 l14 p13 c0 c1)
   deleted: (at p13 l14) (capacity v1 c1)
   added: (in p13 v1) (capacity v1 c0)
   goals met: 7 of 13
30. (drive v1 l14 l13)
   deleted: (at v1 l14)
   added: (at v1 l13)
   goals met: 7 of 13
31. (drop v1 l13 p13 c0 c1)
   deleted: (in p13 v1) (capacity v1 c0)
   added: (at p13 l13) (capacity v1 c1)
   goals met: 8 of 13
32. (drive v1 l13 l14)
   deleted: (at v1 l13)
   added: (at v1 l14)
   goals met: 8 of 13
33. (pick-up v1 l14 p5 c0 c1)
   deleted: (at p5 l14) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 8 of 13
34. (drive v1 l14 l13)
   deleted: (at v1 l14)
   added: (at v1 l13)
   goals met: 8 of 13
35. (drop v1 l13 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l13) (capacity v1 c1)
   goals met: 9 of 13
36. (drive v2 l2 l14)
   deleted: (at v2 l2)
   added: (at v2 l14)
   goals met: 9 of 13
37. (drive v4 l11 l7)
   deleted: (at v4 l11)
   added: (at v4 l7)
   goals met: 9 of 13
38. (pick-up v4 l7 p10 c0 c1)
   deleted: (at p10 l7) (capacity v4 c1)
   added: (in p10 v4) (capacity v4 c0)
   goals met: 9 of 13
39. (drive v4 l7 l5)
   deleted: (at v4 l7)
   added: (at v4 l5)
   goals met: 9 of 13
40. (drive v4 l5 l14)
   deleted: (at v4 l5)
   added: (at v4 l14)
   goals met: 9 of 13
41. (drop v4 l14 p10 c0 c1)
   deleted: (in p10 v4) (capacity v4 c0)
   added: (at p10 l14) (capacity v4 c1)
   goals met: 10 of 13
42. (pick-up v4 l14 p2 c0 c1)
   deleted: (at p2 l14) (capacity v4 c1)
   added: (in p2 v4) (capacity v4 c0)
   goals met: 10 of 13
43. (drive v4 l14 l2)
   deleted: (at v4 l14)
   added: (at v4 l2)
   goals met: 10 of 13
44. (drop v4 l2 p2 c0 c1)
   deleted: (in p2 v4) (capacity v4 c0)
   added: (at p2 l2) (capacity v4 c1)
   goals met: 11 of 13
45. (pick-up v2 l14 p9 c0 c1)
   deleted: (at p9 l14) (capacity v2 c1)
   added: (in p9 v2) (capacity v2 c0)
   goals met: 11 of 13
46. (drive v2 l14 l2)
   deleted: (at v2 l14)
   added: (at v2 l2)
   goals met: 11 of 13
47. (drop v2 l2 p9 c0 c1)
   deleted: (in p9 v2) (capacity v2 c0)
   added: (at p9 l2) (capacity v2 c1)
   goals met: 12 of 13
48. (drive v2 l2 l7)
   deleted: (at v2 l2)
   added: (at v2 l7)
   goals met: 12 of 13
49. (pick-up v2 l7 p7 c0 c1)
   deleted: (at p7 l7) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 12 of 13
50. (drive v2 l7 l5)
   deleted: (at v2 l7)
   added: (at v2 l5)
   goals met: 12 of 13
51. (drive v2 l5 l13)
   deleted: (at v2 l5)
   added: (at v2 l13)
   goals met: 12 of 13
52. (drop v2 l13 p7 c0 c1)
   deleted: (in p7 v2) (capacity v2 c0)
   added: (at p7 l13) (capacity v2 c1)
   goals met: 13 of 13
